---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidNodeId(System.Int32)
source: html/39d401aa-ea92-684d-fd0a-9feed7c4c765.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.IsValidNodeId Method

Verifies if a valid analytical node id.

## Syntax (C#)
```csharp
public bool IsValidNodeId(
	int nodeId
)
```

## Parameters
- **nodeId** (`System.Int32`) - The node id to be verified.

## Returns
True if valid, otherwise false.